Revit 2027 API
Gradient.GradientNoise Property
 The property labeled "Noise Type" from the "Gradient" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string GradientNoise { get; }
Public Shared ReadOnly Property GradientNoise As String
	Get
public:
static property String^ GradientNoise {
	String^ get ();
}
static member GradientNoise : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "GradientNoiseType".
See Also
Reference
Gradient Class
Autodesk.Revit.DB.Visual Namespace